weapons = {
    0: '',
    1: 'Колючий дрин',
    2: 'РПГ-7',
    3: 'Батіг',
    4: 'Бита',
    5: 'БпЛА',
    6: 'Скринька Пандори',
    7: 'Мосінка',
    8: '',
    9: '',
    10: '',
    11: 'Травмат',
    12: 'Діамантове кайло',
    13: 'Колода з кіоску',
    14: 'Сокира Перуна',
    15: 'АК-47',
    16: 'Гумова палиця',
    17: 'Прапор новоросії',
    18: 'Експлойт',
    19: 'Медична пилка',
    20: 'Скляна пляшка',
    21: 'Палаш',
    22: 'Револьвер',
    23: 'Незеритове кайло',
    24: 'Колода Таро',
    25: 'Рунічна сокира Перуна',
    26: 'АКМ',
    27: 'Zeus X27',
    28: 'Прапор СРСР',
    29: 'Rootkit',
    30: 'Ампутатор',
    31: 'Кастет',
    32: 'Золотий палаш',
    33: 'ПП-19 Бізон',
    34: 'Зачароване незеритове кайло',
    35: 'Колесо Фортуни',
    36: 'Аномальна сокира Перуна',
    37: 'AK-74M',
    38: 'Серп і молот',
    39: 'Raspberry Pi',
    40: 'Арбалет хрестоносця',
    41: 'Бойовий ніж',
    42: 'Антикварний палаш'
}

defenses = {
    0: '',
    1: 'Колючий щит',
    2: 'Бронежилет вагнерівця',
    3: 'Міни',
    4: 'Кожух',
    9: 'Уламок бронетехніки',
    16: 'Поліцейський щит',
    17: 'Важкий поліцейський щит',
    18: 'Балістичний щит'
}

supports = {
    0: '',
    1: 'Аптечка',
    2: 'Солярка',
    3: 'Сокира',
    4: 'Кайло',
    5: 'Хліб справжній',
    6: 'Мухомор королівський',
    7: 'Цукор',
    8: 'Квас',
    9: 'Дизель',
    10: 'Швайнокарась',
    11: 'Повістка',
    12: 'Цукерки Рошен',
    13: 'Фронтові 100 грам',
    14: 'Ракетне паливо',
}

heads = {
    0: '',
    1: 'Шапочка з фольги',
    2: 'Тактичний шолом',
    3: 'Кавун базований',
    4: 'Вушанка',
    5: 'Кавуняча крінжа',
    6: 'Ярмулка',
    7: 'Протигаз',
}

upgradable = {
    'weapon': (1, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32),
    'defense': (1, 16, 17),
    'support': (2, 7, 8, 9),
    'head': (1, 5)
}

weapons1 = {
    1: 7,
    11: 22,
    12: 23,
    13: 24,
    14: 25,
    15: 26,
    16: 27,
    17: 28,
    18: 29,
    19: 30,
    20: 31,
    21: 32,
    22: 33,
    23: 34,
    24: 35,
    25: 36,
    26: 37,
    28: 38,
    29: 39,
    30: 40,
    31: 41,
    32: 42
}

defenses1 = {
    1: 4,
    16: 17,
    17: 18
}

supports1 = {
    2: 9,
    7: 12,
    8: 13,
    9: 14
}

heads1 = {
    1: 7,
    5: 3
}
