weapons = {
    0: '',
    1: 'Колючий дрин',
    2: 'РПГ-7',
    3: 'Батіг',
    4: 'Бита',
    5: 'БпЛА',
    6: 'Скринька Пандори',
    7: '',
    8: '',
    9: '',
    10: '',
    11: 'Травмат',
    12: 'Діамантове кайло',
    13: 'Колода з кіоску',
    14: 'Сокира Перуна',
    15: 'АК-47',
    16: 'Гумова палиця',
    17: 'Прапор новоросії',
    18: 'Експлойт',
    19: 'Медична пилка',
    20: 'Скляна пляшка',
    21: 'Палаш',
    22: 'Револьвер',
    23: 'Незеритове кайло',
    24: 'Колода Таро',
    25: 'Рунічна сокира Перуна',
    26: 'АКМ',
    27: '',
    28: 'Прапор СРСР',
    29: 'Rootkit',
    30: 'Ампутатор',
    31: 'Кастет',
    32: 'Золотий палаш'
}

defenses = {
    0: '',
    1: 'Колючий щит',
    2: 'Бронежилет вагнерівця',
    3: 'Міни',
    9: 'Уламок бронетехніки',
    16: 'Поліцейський щит',
    17: 'Важкий поліцейський щит'
}

supports = {
    0: '',
    1: 'Аптечка',
    2: 'Дизель',
    3: 'Сокира',
    4: 'Кайло',
    5: 'Хліб справжній',
    6: 'Мухомор королівський',
    7: 'Цукор',
    8: 'Квас',
    9: 'Ракетне паливо',
    10: 'Швайнокарась'
}

heads = {
    0: '',
    1: 'Шапочка з фольги',
    2: 'Тактичний шолом',
    3: 'Кавун базований',
    4: 'Вушанка',
    5: 'Кавуняча крінжа',
    6: 'Ярмулка'
}
