from random import choice
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton


def merchant_msg():
    slot1 = choice([1, 2, 3])
    slot2 = choice([1, 2, 3])
    slot3 = choice([1, 2, 3])
    markup = InlineKeyboardMarkup()
    msg = 'Прийшов мандрівний торговець, приніс різноманітні товари.\n\n'
    if slot1 == 1:
        msg += '\U0001F6E1 Уламок бронетехніки [Захист, міцність=7, ціна=10] - збільшує силу на бій на 30%. Після' \
               ' зношення повертаються 4 гривні.'
        markup.add(InlineKeyboardButton(text='\U0001F6E1 Купити уламок бронетехніки', callback_data='fragment'))
    if slot1 == 2:
        msg += '\u2708\uFE0F БпЛА [Атака, міцність=1, ціна=90] - за кожен рівень майстерності збільшує силу в ' \
               'масовій битві на 40% та збільшує шанс не втратити зброю на 16%.'
        markup.add(InlineKeyboardButton(text='\u2708\uFE0F Купити БпЛА', callback_data='uav'))
    if slot1 == 3:
        msg += '\U0001F6A7 Міни [Захист, міцність=7, ціна=30] - з шансом 33% завдає ворогу 5 поранень і ' \
               'зменшує міцність зброї на 5. Бронежилет захищає від мін.'
        markup.add(InlineKeyboardButton(text='\U0001F6A7 Купити міни', callback_data='bombs'))

    if slot2 == 1:
        msg += '\n\U0001F344 Мухомор королівський [Допомога, міцність=1, ціна=60] - якщо у ворога більший ' \
               'інтелект, додає +1 інтелекту (не діє проти фокусників). На бій зменшує свою силу на 50%. ' \
               'Максимальна кількість покупок на русака - 3.\n'
        markup.add(InlineKeyboardButton(text='\U0001F344 Купити мухомор', callback_data='mushroom'))
    if slot2 == 2:
        msg += '\U0001F9EA Цукор [Допомога, міцність=2, ціна=180] - збільшує силу за годування на 15 (до 3000) або' \
               ' зменшує шанс зменшення сили на 15%.\n'
        markup.add(InlineKeyboardButton(text='\U0001F9EA Купити цукор', callback_data='sugar'))
    if slot2 == 3:
        msg += '\U0001F37A Квас [Допомога, міцність=5, ціна=35] - русак не втече зі зміни. Додає 5 бойового трансу ' \
               'за роботу в шахті.\n'
        markup.add(InlineKeyboardButton(text='\U0001F37A Купити квас', callback_data='kvs'))

    if slot3 == 1:
        msg += '\U0001F452 Шапочка з фольги [Шапка, міцність=10, ціна=30] - захищає від втрати бойового духу при' \
               ' жертвоприношеннях, при купівлі русак отримує 30 шизофренії.'
        markup.add(InlineKeyboardButton(text='\U0001F452 Купити шапочку з фольги', callback_data='foil'))
    if slot3 == 2:
        msg += '\u2744\uFE0F Вушанка [Шапка, міцність=20, ціна=30] - збільшує ефективність бойового трансу на 2% за' \
               ' кожен рівень алкоголізму.'
        markup.add(InlineKeyboardButton(text='\u2744\uFE0F Купити вушанку', callback_data='ear'))
    if slot3 == 3:
        msg += '\U0001F349 Кавун базований [Шапка, ціна=250] - збільшує силу за годування і гроші за зміну на 5. ' \
               'Зникає тільки тоді, коли сила за годування зменшиться.'
        markup.add(InlineKeyboardButton(text='\U0001F37A Купити кавун базований', callback_data='watermelon'))

    msg += '\n\n\U0001F919 Травмат [Атака, міцність=5, ціна=6] - зменшує силу ворога на бій на 50%.\n' \
           '\U0001F9F0 Діамантове кайло [Атака, міцність=25, ціна=15] - збільшує силу, інтелект і бойовий дух на ' \
           '20%.\n' \
           '\U0001F52E Колода з кіоску [Атака, міцність=3, ціна=5] - міняє твої характеристики з ворогом на бій.\n' \
           '\U0001F5FF Сокира Перуна [Атака, міцність=1, ціна=7] - при перемозі забирає весь бойовий дух ворога, ' \
           'при поразці ворог забирає твій.\n' \
           '\U0001fa96 АК-47 [Атака, міцність=30, ціна=20] - після перемоги активує ефект горілки.\n' \
           '\U0001F46E Поліцейський щит [Захист, міцність=10, ціна=10] - зменшує силу ворога на 20%.\n' \
           '\U0001F921 Прапор новоросії [Атака, міцність=8, ціна=5] - додаткова перемога за перемогу в дуелі.\n' \
           '\U0001F4DF Експлойт [Атака, міцність=2, ціна=9] - шанс активувати здібність хакера - 99%.\n' \
           '\u26D1 Медична пилка [Атака, міцність=8, ціна=10] - якщо у ворога нема поранень - завдає 1, якщо більше ' \
           '4 - лікує 10 і забирає 10 здоров`я.\n' \
           '\U0001F6AC Скляна пляшка [Атака, міцність=10, ціна=5] - зменшує інтелект ворогу на 10.\n' \
           '\U0001F695 Дизель [Допомога, міцність=5, ціна=15] - збільшує власну силу в битвах, міжчатових битвах ' \
           'або рейдах на 25%.\n' \
           '\U0001F396 Палаш [Зброя, міцність=15, ціна=10] - +50% сили проти русаків без клану.'
    markup.add(InlineKeyboardButton(text='\U0001F5E1 Купити спорядження свого класу', callback_data='equipment'))

    return  msg, markup
