from config import r
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton


def wiki_text(data):
    msg = ''
    markup = InlineKeyboardMarkup()
    if data == 'wiki_menu':
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Бої', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F4C8 Розвиток', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        markup.add(InlineKeyboardButton(text='\U0001F530 Клани', callback_data='wiki_clan_description'),
                   InlineKeyboardButton(text='\U0001F9ED Напрями', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001F4DC Паспорт', callback_data='wiki_passport'))
        msg = '\U0001F1FA\U0001F1E6 @RandomUA3bot - бот, який перенесе тебе в альтернативну реальність, у якій ти ' \
              'потрапляєш на Донбас і ловиш русаків.\nЇх можна розвивати, відправляти в бої проти інших ' \
              'русаків, об`єднувати в клани, а також - вбивати.\nТут можна знайти майже всю інформацію щодо гри.'
    elif data.startswith('wiki_duel'):
        markup.add(InlineKeyboardButton(text='\U0001F523 Шанси', callback_data='wiki_chances'),
                   InlineKeyboardButton(text='\U0001F4B0 Рейди', callback_data='wiki_raid'))
        msg = '\u2694\uFE0F Існує 4 типи боїв:\n\n\U0001F5E1 Дуелі - проводяться за викликом бота в інлайн режимі. ' \
              'Нагорода - бойовий дух та гроші. Якщо ворожий русак вдвічі слабший - грошової нагороди не буде, рівн' \
              'ий по силі - 0 або 3-5 гривень, вдвічі сильніший - 3-5 гривень. В дуелях використовується більшість ' \
              'спорядження. Також можливий пошук ворога по силі, особисте запрошення та турнірний режим, в якому ' \
              'нема нагород та не діють деякі вміння. Щоб запустити ці режими, при виклику бота додайте &\n\n' \
              '\U0001F30D Міжчатові битви (/war) - 5 русаків з одного чату проти 5 з іншого. Нагорода - 4 гривні та' \
              ' трофей. Якщо битись за Соледар - нагорода 4-15 гривень. Якщо битись кланом - 6 гривень. Від кількості' \
              ' перемог залежить підбір ворогів. Якщо чат набрав більше 250 перемог - він буде битись з чатами, ' \
              'які теж набрали більше 250 перемог або з тір-1/2 кланами.\n\n' \
              '\U0001F5FA Масові битви (/battle) - "батл-рояль" від 5 русаків. Нагорода - 5 гривень, якщо русаків 10' \
              ' - 10 гривень і трофей. Існують різні локації (більшість з них доступні в битві на 10 русаків) з спец' \
              'іальними нагородами та класові локації з нагородою для певного класу.\n\n' \
              '\U0001F4B0 Рейди (/raid) - 5 русаків в своєму клані збираються проводити рейд на інший клан або локац' \
              'ію. Можна проводити раз в годину.\n\n' \
              '\U0001fac0 Здоров`я - параметр, необхідний для всіх типів боїв. Якщо здоров`я більше або рівне 90 - ' \
              'сила збільшиться на 10%, якщо менше 10 - сила зменшиться до 10%, якщо 0 - ' \
              'потрібно лікування або годування.'
    elif data.startswith('wiki_chances'):
        markup.add(InlineKeyboardButton(text='\u2694\uFE0F Бої', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F4B0 Рейди', callback_data='wiki_raid'))
        msg = '\U0001F523 Шанси\n\nДуелі:\n' \
              'Шанс = сила * (1 + 0.1 * інтелект) * (1 + 0.0001 * бойовий дух)\n\n' \
              'У масових і міжчатових битвах, рейдах та охороні формула та сама, тільки додається ще 25% шансу за ' \
              'наявність зброї, захисту, допомоги та шапки.\n\n' \
              'Також на всі режими діють ці показники (після битви показник зменшиться на 1):\n' \
              '\U0001fa78 Поранення - втричі зменшує силу та вдвічі - бойовий дух.\n' \
              '\U0001F464 Шизофренія - втричі зменшує інтелект та вдвічі - бойовий дух.\n' \
              '\U0001F44A Бойовий транс - збільшує силу на 20% та бойовий дух - на 80%. Кількість трансу не може ' \
              'бути більшою, ніж кількість інтелекту.'
    elif data.startswith('wiki_raid'):
        markup.add(InlineKeyboardButton(text='\u2694\uFE0F Бої', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F523 Шанси', callback_data='wiki_chances'))
        msg = '\U0001F4B0 Рейди\n\nМожна проводити, починаючи з будь-якого рівня, але зарейдити можуть тільки, якщо ' \
              'ваш рівень, як мінімум, угруповання і склад, заповнений на 10%.\nЯкщо рейд проти клану - 70% шанс ' \
              'вкрасти ресурси, 20% - гроші, 10% - руській дух. Гроші видаються всім рейдерам.' \
              '\n\nРейдові локації та нагороди:\n' \
              'Відділення монобанку - гроші, якщо в групі є хакер\n' \
              'Магазин алкоголю - горілка, здоров`я, бойовий дух\n' \
              'АТБ, Сільпо - квас / цукор / кавун / годування, 50% - гроші. В АТБ 5-10 луту, а в Сільпо лут з вдвічі ' \
              'більшою міцністю\n' \
              'Епіцентр - ресурси, 50% - ізострічка\n' \
              'Макіївський роднічок - рускій дух\n' \
              'Ставок швайнокарасів - промокод\n' \
              'Синагога - очки та баф\n\n' \
              '\U0001F4E6 Перехоплення гумконвою - рейдовий режим, який можуть активувати тільки танкісти. Сила - ' \
              '5000000, оновлюється раз в день. Нагорода - по 1 пакунку за кожні 25000 сили команди. ' \
              'За повне розграбування додається 5 пакунків. Час появи - від 8 до 12 години.' \
              ' Одна людина може взяти лут звідти тільки 2 рази в день.\n' \
              'Ставок швайнокарасів - можна активувати, якщо у всієї команди будуть швайнокарасі.\n' \
              'Синагога - активується, перебуваючи у клановій війні та якщо у всієї команди будуть ярмулки. ' \
              '50% шанс отримати саквояж.' \
              '\n\nЗа будь-який рейд є 5% шанс випадіння \U0001F916 секретного коду.'

    elif data.startswith('wiki_clan_description'):
        markup.add(InlineKeyboardButton(text='\U0001F3D7 Будівництво', callback_data='wiki_clan_build'),
                   InlineKeyboardButton(text='\U0001f4ef Війни', callback_data='wiki_clan_war'),
                   InlineKeyboardButton(text='\U0001faac Бафи', callback_data='wiki_clan_buff'))
        msg = '\U0001F530 Клан - об`єднання русаків, яке з кожним рівнем додає більше бонусів.\n' \
              'Всі команди для керування кланом є у /commands.\n Творець клану стає лідером. Заступники можуть' \
              ' бути призначені лідером і мати майже такі самі можливості як лідер.\n\n' \
              '\U0001F47E Для розвитку клану необхідно збирати ресурси (/work) та інвестувати гроші (/invest), щоб ' \
              'покращувати рівень (/upgrade) та розвивати інфраструктуру (/build), ходити в міжчатові битви (/war) ' \
              'та рейди (/raid) разом з учасниками. В певний момент доведеться захищатись від рейдерів (/guard).'

    elif data.startswith('wiki_clan_build'):
        markup.add(InlineKeyboardButton(text='\U0001F530 Клани', callback_data='wiki_clan_description'),
                   InlineKeyboardButton(text='\U0001f4ef Війни', callback_data='wiki_clan_war'),
                   InlineKeyboardButton(text='\U0001faac Бафи', callback_data='wiki_clan_buff'))
        msg = '\U0001F3D7 Список побудов клану, гільдії та угруповання\n\n' \
              '\U0001F3E0 Пилорама - можливість добувати \U0001F333 5-15 деревини від роботи.\n' \
              '\U0001F3E0 Шахта - можливість добувати \U0001faa8 2-10 каміння від роботи.\n' \
              '\U0001F3E0 Склад - можливість зберігати всі види ресурсів.\n' \
              '\U0001F3E0 Цех - можливість добувати \U0001F9F6 2-5 тканини від роботи.\n' \
              '\U0001F3E0 Відділення НП - можливість отримувати \U0001F4FB радіотехніку з пакунків. При включеній ' \
              'зарплаті (/clan_settings), за роботу видаватиметься \U0001F4E6 пакунок (але +2грн податку).\n\n' \
              '\U0001F3E1 Силікатний завод - можливість добувати \U0001F9F1 1-3 цегли від роботи.\n' \
              '\U0001F3E1 Житловий комплекс - розширення максимальної кількості учасників з 25 до 50.\n' \
              '\U0001F3E1 Їдальня - доступ до команди /clan_shop. Продаж кількох товарів, що збільшують ' \
              'бойовий дух русаків.\n' \
              '\U0001F3E1 Монумент - можливість для лідера у \n/clan_shop витрачати \U0001F47E рускій дух.\n' \
              '\U0001F3E1 Стіна оголошень - додатковий щоденний квест (ще +1 через два апгрейди).\n\n' \
              '\U0001F3D8 Блокпост - можливість захищатись від рейдів.\n' \
              '\U0001F3D8 Концтабір - вдвічі більше ресурсів від роботи, якщо є другий русак.\n' \
              '\U0001F3D8 Морг - +0.2% сили в міжчатовій битві за кожного вбитого русака (максимум 20%). ' \
              '\U0001F47E +1 за кожне жертвоприношення.\n'

    elif data.startswith('wiki_clan_war'):
        markup.add(InlineKeyboardButton(text='\U0001F530 Клани', callback_data='wiki_clan_description'),
                   InlineKeyboardButton(text='\U0001F3D7 Будівництво', callback_data='wiki_clan_build'),
                   InlineKeyboardButton(text='\U0001faac Бафи', callback_data='wiki_clan_buff'))
        msg = '\U0001f4ef Кланові війни - спосіб просунути клан в топ та отримати додаткові нагороди. ' \
              'Їхня суть - за 5 днів набрати більше очок ніж ворожий клан.\n/clan_war - зареєструватись на війни ' \
              '(тільки на вихідних). Проходитимуть вони протягом робочого тижня.\n\n' \
              '\U0001fa99 В міжчатовій битві за перемогу можна отримати від 1 до 5 очків проти ворожого та з ' \
              'шансом 10% проти будь-якого клану. За успішний рейд на ворожий клан можна отримати 5-10 очків. ' \
              'Квестові очки видаються за квести або бафи (максимум 500) та сумуються до загальної кількості.\n\n' \
              '\U0001f7e1 Бафи додають певні бонуси у війнах. Чотири з них можна купити у /clan_shop. Перші три ' \
              'одинакові для всіх, четвертий може відрізнятись від рівня клану. П`ятий баф можна отримати з ' \
              'успішних рейдів на синагогу (три рази на війну).\n\n' \
              '\U0001F947 Набравши на 25% більше чи менше очків аніж суперник - клан змінить свій тір. ' \
              'Від нього залежить нагорода, підбір ворогів та рейтинг клану. Щоб вступити в перший тір, або ' \
              'протриматись в ньому треба набрати максимум квестових очків.\n\n' \
              '\U0001fa99 Не зважаючи на те, перемогли ви чи ні, кожному учаснику буде видано по (очки/10) пакунків.' \
              ' А за перемогу отримаєте:\n' \
              'Тір-3: \U0001F9C2 5\n' \
              'Тір-2: \U0001F9C2 10\n' \
              'Тір-1: \U0001F9C2 20 \U0001F916 5'

    elif data.startswith('wiki_clan_buff'):
        markup.add(InlineKeyboardButton(text='\U0001F530 Клани', callback_data='wiki_clan_description'),
                   InlineKeyboardButton(text='\U0001F3D7 Будівництво', callback_data='wiki_clan_build'),
                   InlineKeyboardButton(text='\U0001f4ef Війни', callback_data='wiki_clan_war'))
        msg = '\U0001faac Бафи - тимчасові бонуси, які діють протягом однієї кланової війни. Майже всі бафи можна ' \
              'купити в /clan_shop.\n\nСписок бафів:\n\n' \
              '\U0001f7e2 Додаткова нагорода за рейди на клани (залежить від його рівня та можливого вмісту ' \
              'кланового магазину ворога).\n' \
              '\U0001f7e0 Вдвічі більше очків отримується за рейд на ворожий клан. Вдвічі більше ' \
              'пакунків за перемогу у війні.\n' \
              '\U0001f534 Очки можна отримати з рейду на будь-який клан та рейдити раз в 45 хвилин. ' \
              'Можливість бачити очки ворога.\n' \
              '\U0001f7e3 За роботу на благо громади буде нараховано 1-3 квестових очків замість зарплати.\n\n' \
              'Комуна:\n' \
              '\U0001f7e3\U0001f7e3 +2 очка за звичайні квести.\n' \
              '\U0001f7e3\U0001f7e3\U0001f7e3 25% шанс отримати 3 квестові очки за перемогу в масовій битві.\n' \
              'Коаліція:\n' \
              '\U0001f7e3\U0001f7e3 1% шанс непомітно отримати квестове очко за перемогу в дуелі.\n' \
              '\U0001f7e3\U0001f7e3\U0001f7e3 +12 квестових очків за охорону території.\n' \
              'Асоціація:\n' \
              '\U0001f7e3\U0001f7e3 +30 квестових очків за пограбування гумконвою.\n' \
              '\U0001f7e3\U0001f7e3\U0001f7e3 +10 квестових очків за приєднання учасника в клан.\n' \
              'Організація:\n' \
              '\U0001f7e3\U0001f7e3 Шанс знайти квестове очко в пакунку замість радіотехніки.\n' \
              '\U0001f7e3\U0001f7e3\U0001f7e3 +250 квестових очків.\n\n' \
              '\U0001f7e1 +1 очко за виконання кошерних квестів. +40 квестових очків за купівлю ресурсів за погони. ' \
              '+100 очків. Щоб повністю отримати цей баф треба 3 рази провести успішний рейд на синагогу.'

    elif data.startswith('wiki_clan'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001F9ED Рівні кланів:\n\n' \
              '\U0001f6d6 Банда - можливість обирати фашиста дня, добувати та зберігати деревину і каміння.\n' \
              '\U0001F3E0 Клан - \U0001F4B5 додаткові 4 гривні та \U0001F47E +1 рускій дух за перемоги в ' \
              'міжчатових боях, якщо серед учасників всі з клану.\n' \
              '\U0001F3E1 Гільдія - \U0001F4B5 +34% за роботу на шахтах Соледару.\n' \
              '\U0001F3D8 Угруповання - \U0001F4B5 шанс подвоїти грошову нагороду за перемогу в дуелях.\n\n' \
              'Далі доведеться вибрати один з чотирьох напрямів, які є відсиланням на політичний компас.'
    elif data.startswith('wiki_com'):
        markup.add(InlineKeyboardButton(text='\U0001F9ED', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e5 Комуна\n' \
              'Ресурси в клані добуваються в максимальному обсязі. Ціна на совєцкій пайок зменшена з 10 до 4 гривень.' \
              '\n\nІнфраструктура:\n' \
              'Тракторний завод - можливість купувати уламки бронетехніки та зміцнювати ними броню до 50.\n' \
              'Пивний ларьок - роботяги добувають вдвічі більше ресурсів.\n' \
              'Падік - здібність гопніка буде дійсна, якщо на рахунку до 200 гривень.\n' \
              'Тюрма - сила мусора при охороні збільшиться на 100%.\n\n' \
              '\U0001f7e5 Союз\n' \
              'Можливість виготовити всьому клану по Кожуху та видати Мосінку кожному п\'ятому (10 міцності). ' \
              'Можливість закупити горілку та Фронтові 100 грам (1-5 міцності) тим, хто відпрацював зміну.' \
              '\n\nІнфраструктура:\n' \
              'Воєнкомат - можливість отримати за роботу повістку у вільний слот допомоги. Якщо є повістка - ' \
              'за охорону може бути видано Мосінку, Кожух, Фронтові 100 грам і Вушанку (по 20 міцності).\n' \
              'Гулаг - за покидання клану сила двох русаків зменшиться на 20%. За роботу чи охорону буде шанс ' \
              'отримати додаткове годування по 3% за кожну тисячу деревини, каменю, тканини і цегли. ' \
              'Можливість купувати вушанки.'
    elif data.startswith('wiki_coa'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001F9ED', callback_data='wiki_clan'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e6 Коаліція\n' \
              'За купівлю бойового трансу за рускій дух - додатково збільшиться бойовий дух на 50%. +2 руского духу' \
              ' за перемогу у міжчатових битвах.' \
              '\n\nІнфраструктура:\n' \
              'Штаб тероборони - можливість купувати тактичний шолом та міни. Зменшує ефективність ворожих рейдів на ' \
              '33%.\n' \
              'Березова роща - якщо язичник застосує сокиру Перуна проти іншого язичника - обидва отримають ' \
              'по 10000 бойового духу\n' \
              'Генеральська дача - присутність генерала в міжчатовій битві додатково принесе 1 рускій дух за ' \
              'перемогу.\n' \
              'Казарма - +20% сили гарматному м`ясу в міжчатових битвах.\n\n' \
              '\U0001f7e6 Орден\n' \
              'Можливість купляти РПГ-7 та Бронежилет вагнерівця за кланові гроші і рускій дух ' \
              '(потрібен дозвіл лідера або заступника).' \
              '\n\nІнфраструктура:\n' \
              'Ферма - годування русака лікує до 30 поранень. Можливість зберегти кавун ще на 1 годування.\n' \
              'Ядерний бункер - шизофренія не впливатиме негативно на міжчатові битви та охорону, а навпаки - ' \
              'додаватиме 5 інтелекту. Можливість купляти шапочки з фольги.'
    elif data.startswith('wiki_aso'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001F9ED', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e9 Асоціація\n' \
              'Зменшує силу локацій в рейдах на 50%. Збільшена нагорода за пограбування гумконвою - ' \
              '1 пакунок за кожні 20000 сили. Також учасники тір-3 асоціації можуть забирати нагороду з гумконвою ' \
              '3 рази в день, тір-2 - 4 рази, тір-1 - 5 разів.' \
              '\n\nІнфраструктура:\n' \
              'Dungeon - можливість купувати батіг (+15% сили в рейді, +33% якщо в русака нема жінки).\n'\
              'Бійцівський клуб - втричі більший шанс кинути прогином хачам.\n' \
              'Циганський табір - 20% шанс фокусникам вкрасти грошову нагороду ворога в дуелях.\n' \
              'Радіовежа - малорос в міжчатовій битві надсилає 3 шизофренії випадковому ворогу.\n\n' \
              '\U0001f7e9 Ліга\n' \
              'Якщо під час рейду виявлено, що ціль має більше ресурсів - рейдери вкрадуть вдвічі більше. ' \
              'Можливість грабувати гумконвой без танкістів. В такому випадку, шанс активувати цей режим - 20%. ' \
              'Можливість купувати БпЛА.' \
              '\n\nІнфраструктура:\n' \
              'Готель - максимальна кількість учасників збільшується до 60. Можливість вступати в клан в будь-який ' \
              'момент (не треба чекати тиждень після вступу в попередній клан, а 3 години).\n' \
              'Офіс Червоного Хреста - можливість лікувати весь клан (від поранень та шизи теж), та проводити ' \
              'перерозподіл багатств - за 500 гривень з скарбниці по 100 гривень п`ятьом найбіднішим учасникам. ' \
              'Додаткові 0-5 нагород за розграбування гумконвою.'
    elif data.startswith('wiki_org'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001F9ED', callback_data='wiki_clan'))
        msg = '\U0001f7e8 Організація\n' \
              'Скасовуються податки. Гроші за перемогу в міжчатовій битві також йдуть в скарбницю клану.' \
              '\n\nІнфраструктура:\n' \
              'Біолабораторія - можливість купувати королівські мухомори (тим, в кого русак має до 20 інтелекту).' \
              ' Максимальна кількість покупок на русака - 3\n' \
              'Аптека - патологоанатом з аптечкою отримуватиме по 10 гривень за піднімання русаків.\n' \
              'АЗС - +5 гривень за перемогу таксиста в масовій битві.\n' \
              'Дата-центр - здібність хакера надсилатиме стільки ж грошей в скарбницю клану.\n\n' \
              '\U0001f7e8 Корпорація\n' \
              'За інвестиції від 1000 гривень інвестор отримає по пакунку за кожні 20 гривень. +1% до сили охорони ' \
              'за кожну тисячу гривень у скарбниці (максимум 200%).' \
              '\n\nІнфраструктура:\n' \
              'Торговий центр - можливість купувати Цукор і Квас (з подвоєною міцністю, якщо в клані більше ' \
              'мільйона гривень). Можливість закупити Кавун базований для всього клану.\n' \
              'Невільничий ринок - можливість купувати російських немовлят. Нові русаки з`являтимуться з 500+ сили.'

    elif data.startswith('wiki_grow_feed'):
        markup.add(InlineKeyboardButton(text='\U0001F9C2 Сіль', callback_data='wiki_grow_mine'),
                   InlineKeyboardButton(text='\U0001F919 Класи', callback_data='wiki_grow_class'))
        msg = '\U0001F4C8 Розвиток\n\nУ русака є дві основні характеристики - \U0001F4AA сила та \U0001F9E0 інтелект.' \
              '\n\n\U0001F372 Годуючи, можна збільшити силу на 1-30 та інтелект на 1 (шанс 20%). В магазині можна ' \
              'купити утеплену будку, яка збільшуватиме силу на 15 до 5000 сили.\n\n' \
              '\U0001F4AA Якщо в русака від 5000 сили, то вона може зменшитись з шансом 20%, а якщо більше 8000 - ' \
              '40%. Також є 20% шанс шо русак захворіє і нічо не зміниться.\n\n' \
              '\U0001F54A З шансом 30% годування збільшить \U0001F54A бойовий дух на 1000, а з шансом 5% - до ' \
              'максимуму (10000).\nМаксимальна кількість інтелекту - 20.'
    elif data.startswith('wiki_grow_mine'):
        markup.add(InlineKeyboardButton(text='\U0001F372 Розвиток', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\U0001F919 Класи', callback_data='wiki_grow_class'))
        msg = '\u2692 Соляні шахти (/mine) - місце, де можна заробити гроші (3-8) або інтелект (шанс 10%), ' \
              'відпрацювавши зміну. ' \
              'Повністю прокачавши майстерність (/skills) можна заробляти на 2 гривні більше, збільшити шанс ' \
              'отримати інтелект до 20% та зразу отримати 2 інтелекту. Якщо інтелект максимальний - може бути ' \
              'додатково видано 20 гривень. В суботу і неділю зарплата вдвічі більша. Також 20% шанс, що русак ' \
              'втече і нап`ється. 25% шанс забрати з собою одну сіль.\n\n' \
              '\U0001F9C2 Також сіль можна отримати виконуючи щоденні квести (/quest). Витрачати її можна в ' \
              'спеціальному магазині на підвищення сили або інші товари.'
    elif data.startswith('wiki_grow_class'):
        markup.add(InlineKeyboardButton(text='\U0001F372 Розвиток', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\U0001F9C2 Сіль', callback_data='wiki_grow_mine'))
        msg = 'Розвинувши інтелект до певного рівня, можна вибрати клас (/class). Вплив класів на розвиток:\n\n' \
              '\U0001F919\U0001F919\U0001F919 Гроза Кавказу кожен день може збільшувати силу на 10 та один раз - ' \
              'на 200.\n\U0001F9F0 Роботяга не хворіє, але вдвічі більше п`є.\n' \
              '\U0001F9F0\U0001F9F0 - Почесний алкаш швидше качає вміння.\n' \
              '\U0001F9F0\U0001F9F0\U0001F9F0 - П`яний майстер - при певній умові може годуватись два рази.\n' \
              '\U0001F52E Фокусник та Злий геній отримують додатковий інтелект при виборі класу.\n' \
              '\U0001F921 Малорос може анулювати інтелект за мухомори всім в чаті.\n' \
              '\U0001F4DF\U0001F4DF Кіберзлочинець точно може успішно відпрацювати зміну, та купувати необмежену ' \
              'кількість мухоморів в торговця.\n' \
              '\U0001F6AC\U0001F6AC Зек вдвічі збільшує бонус сили від утепленої будки.\n' \
              '\U0001F396 Офіцер може отримати інтелект в міжчатових битвах.'

    elif data.startswith('wiki_weapons_0'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='🧌 Комплекти', callback_data='wiki_weapons_sets'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F9F3 Інвентар (/i) вміщує спорядження чотирьох типів - Зброя, Захист, Допомога та Шапка. ' \
              'Зазвичай зброя використовується в дуелях при атаці, захист в дуелях, коли кидаєш бій, ' \
              'а допомога і шапка - в певних випадках.\n\n' \
              '\U0001F510 В інвентарі можна викинути непотрібне спорядження, для того, щоб купити або отримати нове ' \
              'з успішних рейдів, оскільки в багатьох випадках воно не заміняється автоматично.\n\n' \
              '\U0001F392 Рюкзак - місце, куди можна покласти майже будь-яке спорядження, для того, щоб в потрібний ' \
              'момент замінити його на наявне або перекинути на іншого русака. Спочатку туди можна покласти ' \
              'один предмет, але за 5 погонів можна купити місце для другого. В рюкзаку можна зберігати навіть ' \
              'класове спорядження, але забрати його може тільки русак потрібного класу. Міцність одинакових ' \
              'предметів не сумується.\n\n' \
              '🌀 Ізострічка - ресурс, завдяки якому можна перетворювати спорядження в покращені версії. ' \
              'Ціна покращення звичайного спорядження - 🌀 1, а вже один раз покращеного - 🌀 3.'

    elif data.startswith('wiki_weapons_sets'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '[beta]\n\n🧌 Комплекти - набір з 4 елементів спорядження, який активує додаткові ефекти.\n\n' \
              '✅ 🚜 Комплект безстрашного діда\n\n' \
              'Можливість підвищити міцність одного спорядження до 50 за ізострічку. ' \
              '+20% шанс почати рейд знову після невдачі або магазину алкоголю.\n\n' \
              '🗡 Мосінка / Серп і молот\n' \
              '🛡 Кожух\n' \
              '🧪 Фронтові сто грам / Ракетне паливо\n' \
              '🎩 Вушанка\n\n' \
              '✅ 💣 Комплект елітного терориста\n\n' \
              'Наявність шизофренії не впливає на дуелі, масові битви та рейди. ' \
              '10% шанс провести рейд на Соледар.\n\n' \
              '🗡 РПГ-7 / SuperCum S350 / ПП-19 Бізон / АК-74М / Raspberry Pi / Арбалет хрестоносця\n' \
              '🛡 Бронежилет вагнерівця / Балістичний щит\n' \
              '🧪 Підсумок медичний\n' \
              '🎩 Тактичний шолом\n\n' \
              '❎ ☣ Комплект сталкера\n\n' \
              '+2-6 сили за годування з хворобою. ' \
              'Міняє рейдові локації на тематичні, якщо в групі всі з цим комплектом.\n\n' \
              '🗡 ВСС / В\'язанка болтів / Аномальна сокира Перуна / Бойовий ніж\n' \
              '🛡 Екзоскелет\n' \
              '🧪 Артефакт\n' \
              '🎩 Протигаз\n\n' \
              '❎ ✡ Комплект хитрого гоя\n\n' \
              'Можливість збільшити міцність всього комплекту на 7 за погон (максимум 30). ' \
              'Гарантована перемога в синагогах\n\n' \
              '🗡 Саквояж / Антикварний палаш\n' \
              '🛡 Сюртук\n' \
              '🧪 Цукерки Рошен\n' \
              '🎩 Ярмулка\n\n' \
              '❎ 🧿 Містичний комплект\n\n' \
              'Можливість ввести промокод, який можна знайти на місці одного з існуючих.\n\n' \
              '🗡 Скринька Пандори / Зачароване незеритове кайло / Колесо Фортуни\n' \
              '🛡 Контакт-1\n' \
              '🧪 Швайнокарась\n' \
              '🎩 Кавун базований'
    elif data.startswith('wiki_weapons_class1'):
        markup.add(InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F9F3 Список класового спорядження\n\n' \
              '\U0001F919 Травмат [Зброя, міцність=5] - зменшує силу ворога на бій на 50%.\n\n' \
              '\U0001F9F0 Діамантове кайло [Зброя, міцність=25] - збільшує силу, інтелект і бойовий дух ' \
              'на 20%.\n\n' \
              '\U0001F52E Колода з кіоску [Зброя, міцність=3] - міняє твої характеристики з ворогом на бій.\n\n' \
              '\U0001F5FF Сокира Перуна [Зброя, міцність=1] - при перемозі забирає весь бойовий дух ворога, ' \
              'при поразці ворог забирає твій.\n\n' \
              '\U0001fa96 АК-47 [Зброя, міцність=30] - після перемоги активує ефект горілки.\n\n' \
              '\U0001F46E Гумова палиця [Зброя, міцність=∞] - постійна зброя. В дуелі ігнорує бойовий дух двох ' \
              'сторін. Якщо є поліцейський щит - ігнорує лише бойовий дух ворога.\n\n' \
              '\U0001F46E Поліцейський щит [Захист, міцність=10] - зменшує силу ворога на 20% як і в захисті, ' \
              'так і в атаці.\n\n' \
              '\U0001F921 Прапор новоросії [Зброя, міцність=8] - додаткова перемога за перемогу в дуелі.\n\n' \
              '\U0001F4DF Експлойт [Зброя, міцність=2] - шанс активувати здібність хакера - 99%.\n\n' \
              '\u26D1 Медична пилка [Зброя, міцність=8] - якщо у ворога нема поранень - завдає 1. Лікує ворогу від ' \
              '4 до 10 поранень або шизофренії і стільки ж здоров`я.\n\n' \
              '\U0001F6AC Скляна пляшка [Зброя, міцність=10] - зменшує інтелект ворогу на 10.\n\n' \
              '\U0001F695 Солярка [Допомога, міцність=5] - збільшує власну силу в масових битвах та міжчатових битвах '\
              'на 20%.\n\n' \
              '\U0001F396 Палаш [Зброя, міцність=15] - +100% сили проти русаків без клану, +25% в іншому випадку.\n\n' \
              'Щоб переглянути покращене класове спорядження - натисніть 🌀 або 🌀🌀🌀'
    elif data.startswith('wiki_weapons_class2'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F9F3 Список покращеного класового спорядження\n\n' \
              '\U0001F919 Револьвер [Зброя] - зменшує силу, інтелект та бойовий дух ворога на бій на 50%.\n\n' \
              '\U0001F9F0 Незеритове кайло [Зброя] - збільшує силу, інтелект і бойовий дух ' \
              'на 20%. 66% шанс не зменшити міцність в дуелях.\n\n' \
              '\U0001F52E Колода Таро [Зброя] - міняє твої характеристики з ворогом на бій. ' \
              'Передає 5 своєї шизофренії ворогу.\n\n' \
              '\U0001F5FF Рунічна сокира Перуна [Зброя] - при перемозі забирає весь бойовий дух ворога, ' \
              'при поразці ворог забирає твій та отримує 5 поранень або шизофренії.\n\n' \
              '\U0001fa96 АКМ [Зброя] - після перемоги активує ефект горілки. +25% сили в міжчатових битвах.\n\n' \
              '\U0001F46E Zeus X27 [Зброя, міцність=1] - зменшує здоров\'я ворога в дуелі до 0.\n\n' \
              '\U0001F46E Важкий поліцейський щит [Захист] - зменшує силу ворога на 20% як і в захисті, ' \
              'так і в атаці. Захищає від РПГ-7, зменшуючи свою міцність на 50% + 5.\n\n' \
              '\U0001F921 Прапор СРСР [Зброя] - додаткова перемога та +2 бойового трансу ' \
              'за перемогу в дуелі.\n\n' \
              '\U0001F4DF Rootkit [Зброя] - шанс активувати здібність хакера - 99%. ' \
              'Black Hat може отримати до 10 гривень.\n\n' \
              '\u26D1 Ампутатор [Зброя] - якщо у ворога нема поранень - завдає 1. Лікує ворогу від ' \
              '15 поранень або шизофренії і стільки ж здоров`я.\n\n' \
              '\U0001F6AC Кастет [Зброя] - зменшує інтелект ворогу на 10 та завдає йому 1 поранення та шизофренію.\n\n'\
              '\U0001F695 Дизель [Допомога] - збільшує власну силу в масових битвах, міжчатових битвах '\
              'та рейдах на 20%.\n\n' \
              '\U0001F396 Золотий палаш [Зброя] - +100% сили проти русаків без клану, +25% в іншому ' \
              'випадку, +100% сили проти тих, хто не має погонів російських генералів, +25% проти тих, хто має.'
    elif data.startswith('wiki_weapons_class3'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F9F3 Список двічі покращеного класового спорядження\n\n' \
              '\U0001F919 ПП-19 Бізон [Зброя] - зменшує силу, інтелект та бойовий дух ворога на бій на 50%. ' \
              'Діє в захисті. ' \
              'Активує здібності хача, навіть якщо у ворога є зброя та вдвічі збільшує ефективність прийомів.\n\n' \
              '\U0001F9F0 Зачароване незеритове кайло [Зброя] - збільшує силу, інтелект і бойовий дух ' \
              'на 33%. 66% шанс не зменшити міцність в дуелях. При перемозі збільшує міцність на 3 (максимум 100).\n\n'\
              '\U0001F52E Колесо Фортуни [Зброя] - міняє твої характеристики з ворогом на бій. ' \
              'Передає 5 своєї шизофренії ворогу. Шанс, який дорівнює інтелекту, збільшити кількість луту з ' \
              'рейду, замість зменшення.\n\n' \
              '\U0001F5FF Аномальна сокира Перуна [Зброя] - при перемозі передає всю свою шизофренію ворогу, ' \
              'при поразці є 25% шанс втратити сокиру і отримати 1-100 шизофренії..\n\n' \
              '\U0001fa96 AK-74M [Зброя] - після перемоги активує ефект горілки. +25% сили в міжчатових битвах. ' \
              'Блокує зброю ворога з шансом 75%.\n\n' \
              '\U0001F46E Балістичний щит [Захист] - зменшує силу ворога на 20% як і в захисті, так і в атаці. ' \
              'Захищає від РПГ-7, зменшуючи свою міцність на 50% + 5. Ігнорує ефект поранення в дуелях.\n\n' \
              '\U0001F921 Серп і молот [Зброя] - додаткова перемога та +2 бойового трансу ' \
              'за перемогу в дуелі. Шизофренія ворога в два рази сильніша.\n\n' \
              '\U0001F4DF Raspberry Pi [Зброя] - шанс активувати здібність хакера - 99%. ' \
              'Black Hat може отримати до 10-12 гривень. При невдалій зміні на шахтах - отримує інформацію про ' \
              'прибуття торговця. Шанс, який дорівнює інтелекту, отримати інформацію про прибуття гумконвою, ' \
              'ставши на охорону.\n\n' \
              '\u26D1 Арбалет хрестоносця [Зброя] - якщо у ворога нема поранень - завдає 1. Лікує ворогу від ' \
              '15 поранень або шизофренії і стільки ж здоров`я. Зменшує здоров\'я ворогам у міжчатовій битві на 10 ' \
              '(не стакається).\n\n' \
              '\U0001F6AC Бойовий ніж [Зброя] - зменшує інтелект ворогу на 10 та завдає йому 1 поранення та ' \
              'шизофренію. Збільшує нагороду в дуелі на 34%, якщо у ворога є поранення.\n\n' \
              '\U0001F695 Ракетне паливо [Допомога] - збільшує власну силу в масових битвах, міжчатових битвах ' \
              'та рейдах на 20%. Зменшує силу, необхідну для отримання пакунку з гумконвою на 1000.\n\n' \
              '\U0001F396 Антикварний палаш [Зброя, \U0001f7e1] - +100% сили проти русаків без клану, ' \
              '+25% в іншому випадку, +100% сили проти тих, хто не має погонів російських генералів, +25% проти тих, ' \
              'хто має. В дуелі збільшує інтелект на 1 та нагороду на 10% за кожен елемент легендарного спорядження ' \
              '(діє також на ворога).'
    elif data.startswith('wiki_weapons_1'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F5E1 Список зброї\n\n' \
              '\u26AA Колючий дрин [міцність=1] - перед боєм онуляє ворогу бойовий дух, якщо його значення ' \
              'від 300 до 1000, зменшує на 1000, якщо від 1000 до 2500 і зменшує на 20/30/40%, якщо бойовий ' \
              'дух більше 2500). Можна купити в магазині.\n\n' \
              '\u26AA Мосінка - покращений дрин. +1% сили в міжчатовій битві за кожну міцність зброї (максимум 25%).\n'\
              '\n\u26AA Бита [міцність=3] - блокує захист і зброю ворога. Доступний для ' \
              'покупки в магазині Скінхеду чи Білому вождю.\n\n' \
              '\U0001f535 БпЛА [міцність=1] - за кожен рівень майстерності (/skills) збільшує силу в масовій битві ' \
              'на 50% та збільшує шанс не втратити зброю на 18%. Можна купити в мандрівного торговця або в Лізі.\n\n' \
              '\U0001f535 SuperCum S350 - за кожен рівень майстерності (/skills) збільшує силу в масовій '\
              'битві на 50% та збільшує шанс не втратити зброю на 18%. Завдає +1-5 поранень ворожим охоронцям при ' \
              'рейді на клан.\n\n' \
              '\U0001f7e3 Батіг [міцність=3] - +15% сили в рейді, +33% якщо в русака нема жінки.' \
              ' Доступно для покупки в Асоціації.\n\n' \
              '\U0001f7e3 Саквояж [міцність=7] - гарантовані +3 солі за щоденну гру у @wordle1bot. ' \
              'Можна отримати за рейд на синагогу.\n\n' \
              '\U0001f7e1 РПГ-7 - [міцність=1] - віднімає ворогу бойовий дух, здоров`я і все спорядження, завдає 300 ' \
              'поранень. Використовується проти русаків, сила яких більша ніж 2000. ' \
              'Можна знайти в пакунках або купити в Ордені.'
    elif data.startswith('wiki_weapons_2'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F6E1 Список захисного спорядження\n\n' \
              '\u26AA Колючий щит [міцність=1] - перед боєм онуляє атакуючому ворогу бойовий дух, якщо його значення ' \
              'від 300 до 1000, зменшує на 1000, якщо від 1000 до 2500 і зменшує на 20/30/40%, якщо бойовий ' \
              'дух більше 2500). Можна купити в магазині.\n\n' \
              '\u26AA Кожух - покращений щит. +1 гривня за перемогу в міжчатовій битві.\n\n' \
              '\u26AA Уламок бронетехніки [міцність=7] - збільшує силу на бій на 30%. Після зношення отримаєте ' \
              '4 гривні. Можна знайти в пакунку або купити в мандрівного торговця.\n\n' \
              '\U0001f535 Міни [міцність=3] - з шансом 33% завдає ворогу 5 поранень і зменшує міцність зброї на 5. ' \
              'Можливість використати міни при захисті клану. ' \
              'Доступні для покупки в торговця та в Коаліції.\n\n' \
              '\U0001f7e3 Сюртук [міцність=7] - збільшує зарплату за працю чи охорону в 3 рази (в 5 разів, якщо є ' \
              'Telegram Premium). Отримується за інвестицію від 1000 гривень (необхідний вільний слот захисту).\n\n' \
              '\U0001f7e1 Бронежилет вагнерівця [міцність=50] - зменшує силу ворога на бій на 75%. ' \
              'Захищає від РПГ-7, зменшуючи свою міцність на 50% + 5. Можна знайти в пакунках або купити в Ордені.'
    elif data.startswith('wiki_weapons_3'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'),
                   InlineKeyboardButton(text='\U0001F3A9 Шапка', callback_data='wiki_weapons_4'))
        msg = '\U0001F9EA Список допоміжного спорядження\n\n' \
              '\u26AA Аптечка [міцність=10] - збільшує здоров`я на 5 при купівлі і на 10 в дуелі. Якщо слот допомоги' \
              ' зайнятий - додає 50 здоров`я. Можна купити в магазині.\n\n' \
              '\u26AA Підсумок медичний [міцність=40] - покращена аптечка. ' \
              'Збільшує здоров`я в дуелі та міжчатовій битві на 10.\n\n' \
              '\u26AA Сокира [міцність=3] - дає можливість добути 1-10 деревини, поки не побудований клан. ' \
              'Можна купити в Банді.\n\n' \
              '\u26AA Кайло [міцність=3] - дає можливість добути 1-5 каміння, поки не побудований клан. ' \
              'Можна купити в Банді.\n\n' \
              '\u26AA Хліб справжній [міцність=1] - додає \U0001F54A +10000 при годуванні. ' \
              'Якщо допоміжне спорядження вже є, додає \U0001F54A +3000. Можна купити в Гільдії.\n\n' \
              '\U0001f535 Цукор [міцність=2] - збільшує силу за годування на 15 (до 5000) або' \
              ' зменшує шанс зменшення сили на 15%. Додає 5 бойового трансу. Можна купити в мандрівного торговця, ' \
              'отримати в рейдах, купити в Корпорації.\n\n' \
              '\U0001f535 Цукерки Рошен - покращений цукор. Здібність та сама, але активується при годуванні, навіть' \
              ' якщо споряджено на другого русака.\n\n' \
              '\U0001f535 Квас [міцність=5] - русак не втече зі зміни. Додає 5 бойового трансу за роботу в шахті.' \
              ' Можна купити в мандрівного торговця, отримати в рейдах, купити в Корпорації.\n\n' \
              '\U0001f535 Фронтові 100 грам - покращений квас. Окрім здібності квасу - ' \
              'активує бойовий транс, якщо його нема.\n\n' \
              '\U0001f535 Повістка - автоматична перемога в дуелі, якщо у ворога є допомога. В іншому випадку ' \
              'повістка передається йому.\n\n' \
              '\U0001f7e3 Мухомор королівський [міцність=1] - якщо у ворога більший інтелект, додає +1 інтелекту ' \
              '(не діє проти фокусників). На бій зменшує свою силу на 50%.\n\n' \
              '\U0001f7e1 Швайнокарась [міцність=3, максимальна_міцність=3] - може виконувати бажання русаків ' \
              '(відпочивати, нажертись, напитись).'
    elif data.startswith('wiki_weapons_4'):
        markup.add(InlineKeyboardButton(text='\U0001fa96 Класове спорядження', callback_data='wiki_weapons_class1'))
        markup.add(InlineKeyboardButton(text='🌀', callback_data='wiki_weapons_class2'),
                   InlineKeyboardButton(text='🌀🌀🌀', callback_data='wiki_weapons_class3'))
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Зброя', callback_data='wiki_weapons_1'),
                   InlineKeyboardButton(text='\U0001F6E1 Захист', callback_data='wiki_weapons_2'))
        markup.add(InlineKeyboardButton(text='\U0001F9EA Допомога', callback_data='wiki_weapons_3'),
                   InlineKeyboardButton(text='\U0001F9F3 Інвентар', callback_data='wiki_weapons_0'))
        msg = '\U0001F3A9 Список шапок\n\n' \
              '\U0001f535 Вушанка [міцність=20] - збільшує ефективність бойового трансу на 2% за кожен рівень' \
              ' алкоголізму (/skills). Можна купити в мандрівного торговця або в Союзі.\n\n' \
              '\U0001f535 Кавуняча крінжа [міцність=1] - збільшує силу за годування і гроші за зміну на 5. ' \
              'Можна отримати в Ордені, якщо зникає кавун.\n\n' \
              '\U0001f535 Кавун базований [міцність=∞] - збільшує силу за годування і гроші за зміну на 5. ' \
              'Зникає тільки тоді, коли сила за годування зменшиться. Можна купити в мандрівного торговця, ' \
              'отримати в рейдах, купити в Корпорації.\n\n' \
              '\U0001f7e3 Тактичний шолом [міцність=40] - збільшує силу в дуелях і міжчатових битвах на 31%. ' \
              'Можна купити в Коаліції.\n\n' \
              '\U0001f7e3 Шапочка з фольги [міцність=10] - захищає від втрати бойового духу при жертвоприношеннях.' \
              'При купівлі в торговця чи в Ордені русак отримує 30 шизофренії, а при отриманні з пакунків - 10.\n\n' \
              '\U0001f7e3 Протигаз - покращена шапочка з фольги. +3000 бойового духу при жертвоприношеннях, ' \
              'замість втрати.\n\n' \
              '\U0001f7e1 Ярмулка [міцність=7, невразлива_до_РПГ] - надає доступ до кошерних квестів (вдвічі більша ' \
              'нагорода, але і більша складність їх виконання). 100% шанс отримати сіль в соляних шахтах. ' \
              'Міцність зменшується при взятті квестів. Можна знайти в пакунку або купити в магазині за погон.'

    elif data.startswith('wiki_passport'):
        markup.add(InlineKeyboardButton(text='\U0001F4E6 Пакунки', callback_data='wiki_pack'),
                   InlineKeyboardButton(text='\u2B50 Досягнення', callback_data='wiki_achieve'))
        msg = '\U0001F4DC Паспорт\n\n' \
              '\U0001F3C6 Перемоги можна отримати за... перемоги в дуелях, масових та міжчатових битвах.\n' \
              '\U0001F3C5 Трофеї можна отримати за перемоги в масових та міжчатових битвах.\n' \
              '\u2620\uFE0F Русаків можна вбивати, продавши жінку. Також можна зарізати свого ' \
              'або знайти в пакунку чужого.\n' \
              '\U0001F476 Немовлят можна отримувати провідуючи жінку, за фашиста дня і за досягнення.\n' \
              '\u2622 Найпростіший спосіб отримати горілку - купити в магазині.\n' \
              '\U0001F4E6 Донбаські пакунки можна придбати командою /pack або купити в \n/donate_shop\n' \
              '\u26CF Вміння можна качати в /skills\n' \
              '\u2B50 /achieve - подивитись досягнення (ачівки - фрази з українських пісень).\n\n' \
              '\U0001F947 Формула розрахунку рейтингу:\n' \
              'Рейтинг = сила + інтелект * 10 + перемоги + трофеї * 10 + вбивства * 14 + немовлята * 88\n\n' \
              '\u26CF Промокоди - невелика нагорода, яку можна отримати один раз, активувавши командою ' \
              '/promo_code <промокод>. Промокод, який зміцнює спорядження:\n' \
              + r.hget('promo_code', 'strength_promo_code').decode()
    elif data.startswith('wiki_pack'):
        markup.add(InlineKeyboardButton(text='\U0001F4DC Паспорт', callback_data='wiki_passport'),
                   InlineKeyboardButton(text='\u2B50 Досягнення', callback_data='wiki_achieve'))
        msg = 'Предмети в пакунках і шанси випадіння:\n\n' \
              '\u26AA Нічого - 20% (або радіотехніка)\n' \
              '\u26AA Спорядження класу - 18%\n' \
              '\u26AA Дрин і щит - 15%\n' \
              '\u26AA 4 гривні - 12%\n' \
              '\u26AA Уламок - 10%\n' \
              '\U0001f535 50 гривень - 7%\n' \
              '\U0001f535 20 горілки - 6%\n' \
              '\U0001f535 Мертвий русак - 5%\n' \
              '\U0001f7e3 Мухомор королівський - 2%\n' \
              '\U0001f7e3 Шапочка з фольги - 2%\n' \
              '\U0001f7e3 Ізострічка - 1%\n' \
              '\U0001f7e3 300 грн, годування і ачівка - 1%\n' \
              '\U0001f7e1 РПГ-7 - 0.225%\n' \
              '\U0001f7e1 Бронежилет - 0.225%\n' \
              '\U0001f7e1 Швайнокарась - 0.225%\n' \
              '\U0001f7e1 Ярмулка - 0.225%\n' \
              '\U0001f7e1 Погон російського генерала - 0.1%'
    elif data.startswith('wiki_achieve'):
        markup.add(InlineKeyboardButton(text='\U0001F4DC Паспорт', callback_data='wiki_passport'),
                   InlineKeyboardButton(text='\U0001F4E6 Пакунки', callback_data='wiki_pack'))
        msg = 'Досягнення і як їх отримати:\n\n' \
              '\u26AA Хто не з нами, той нехай йде собі до сраки - попрацювати в Соледарі за допомогою секретної ' \
              'команди\n' \
              '\u26AA І москаля нема, немає москаля - влаштувати одне вбивство\n' \
              '\u26AA Моя фамілія Залупа - купити трофейний паспорт\n' \
              '\u26AA Наливай, куме, горілки стаканчик - випити 150 горілки \n' \
              '\u26AA Бігає по полю весело кабанчик - погодувати русака 15 разів\n' \
              '\U0001f535 Геніальний розум, великий чоловік - набрати 20 інтелекту\n' \
              '\U0001f535 Гордо і достойно ти живеш свій вік - набрати 2000 сили\n' \
              '\U0001f535 Зараз розберемося, кому належить вулиця - увійти в масову битву і нажати /achieve\n' \
              '\U0001f535 Ах лента за лентою набої подавай - Купити спорядження свого класу в торговця\n' \
              '\U0001f7e3 Ніколи не плач на радість орді - набрати 10000 бойового духу і виконати команду /achieve\n' \
              '\U0001f7e3 Ворога знищено, як був наказ - набрати 1000 перемог\n' \
              '\U0001f7e3 Я заводжу хімікат, розпочинаю атентат - вибити з пакунків\n' \
              '\U0001f7e3 А до берега тихо хвилі несуть поранені душі живих кораблів - бути в стані бойового трансу ' \
              'з пораненням і шизофренією\n' \
              '\U0001f534 Я мав купу бабок, я мав купу справ - інвестувати в клан мінімум 500 гривень за раз\n' \
              '\U0001f534 Танцюй і пий, поки живий - отримати як мінімум чверть бонусу від моргу в міжчатовій битві\n' \
              '\U0001f534 Кривавий пастор - влаштувати 15 вбивств і з`їсти 15 російських немовлят'

    if not data == 'wiki_menu':
        markup.add(InlineKeyboardButton(text='\u21A9\uFE0F', callback_data='wiki_menu'))
    return msg, markup
