from config import r
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton


def wiki_text(data):
    msg = ''
    markup = InlineKeyboardMarkup()
    if data == 'wiki_menu':
        markup.add(InlineKeyboardButton(text='\U0001F5E1 Бої', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F4C8 Розвиток', callback_data='wiki_grow_feed'))
        markup.add(InlineKeyboardButton(text='\U0001F530 Клан', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001F4DC Паспорт', callback_data='wiki_passport'))
        msg = '\U0001F1FA\U0001F1E6 @Random_UAbot - бот, який перенесе тебе в альтернативну реальність, у якій ти ' \
              'потрапляєш на Донбас і ловиш русаків.\nЇх можна розвивати, відправляти в бої проти інших ' \
              'русаків, об`єднувати в клани, а також - вбивати.\nТут можна знайти майже всю інформацію щодо гри.'
    if data.startswith('wiki_duel'):
        markup.add(InlineKeyboardButton(text='\U0001F523', callback_data='wiki_chances'),
                   InlineKeyboardButton(text='\U0001F4B0', callback_data='wiki_raid'))
        msg = '\u2694\uFE0F Існує 4 типи боїв:\n\n\U0001F5E1 Дуелі - проводяться за викликом бота в інлайн режимі. ' \
              'Нагорода - бойовий дух та гроші. Якщо ворожий русак вдвічі слабший - грошової нагороди не буде, рівн' \
              'ий по силі - 0-3 гривні, вдвічі сильніший - 1-3 гривні. В дуелях використовується більшість спорядже' \
              'ння. Також можливий пошук ворога по силі, особисте запрошення та турнірний режим, в якому нема нагор' \
              'од та не діють деякі вміння. Щоб запустити ці режими, при виклику бота додайте &\n' \
              '\U0001fac0 Здоров`я - параметр, необхідний для дуелей. Якщо здоров`я більше 90 - сила збільшиться на' \
              ' 10%, якщо 0 - потрібно лікування.\n\n' \
              '\U0001F30D Міжчатові битви (/war) - 5 русаків з одного чату проти 5 з іншого. Нагорода - 3 гривні та' \
              ' трофей. Якщо битись за Соледар - нагорода 3-10 гривень. Якщо битись кланом - 6 гривень.\n\n' \
              '\U0001F5FA Масові битви (/battle) - "батл-рояль" від 5 русаків. Нагорода - 5 гривень, якщо русаків 10' \
              ' - 10 гривень і трофей. Існують різні локації (більшість з них доступні в битві на 10 русаків) з спец' \
              'іальними нагородами та класові локації з нагородою для певного класу.\n\n' \
              '\U0001F4B0 Рейди (/raid) - 5 русаків в своєму клані збираються проводити рейд на інший клан або локац' \
              'ію. Можна проводити раз в годину.'
    if data.startswith('wiki_chances'):
        markup.add(InlineKeyboardButton(text='\u2694\uFE0F', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F4B0', callback_data='wiki_raid'))
        msg = '\U0001F523 Шанси\n\nДуелі:\n' \
              'Шанс = сила * (1 + 0.1 * інтелект) * (1 + 0.0001 * бойовий дух)\n\n' \
              'У масових і міжчатових битвах, рейдах та охороні формула та сама, тільки додається ще 25% шансу за ' \
              'наявність зброї, захисту, допомоги та шапки.\n\n' \
              'Також на всі режими діють ці показники (після битви показник зменшиться на 1):\n' \
              '\U0001fa78 Поранення - втричі зменшує силу та вдвічі - бойовий дух.\n' \
              '\U0001F464 Шизофренія - втричі зменшує інтелект та вдвічі - бойовий дух.\n' \
              '\U0001F44A Бойовий транс - збільшує силу на 20% та бойовий дух - на 80%. Кількість трансу не може ' \
              'бути більшою, ніж кількість інтелекту.'
    if data.startswith('wiki_raid'):
        markup.add(InlineKeyboardButton(text='\u2694\uFE0F', callback_data='wiki_duel'),
                   InlineKeyboardButton(text='\U0001F523', callback_data='wiki_chances'))
        msg = '\U0001F4B0 Рейди\n\nМожна проводити, починаючи з будь-якого рівня, але зарейдити можуть тільки, якщо ' \
              'ваш рівень, як мінімум, угруповання і склад, заповнений на 10%.\nЯкщо рейд проти клану - 70% шанс ' \
              'вкрасти ресурси, 20% - гроші, 10% - рускій дух.\n\nРейдові локації та нагороди:\n' \
              'Відділення монобанку - гроші, якщо в групі є 2 хакери\n' \
              'Магазин алкоголю - горілка, здоров`я, бойовий дух\n' \
              'АТБ, Сільпо - квас / цукор / кавун / годування, 50% - гроші\n' \
              'Епіцентр - ресурси\n' \
              'Макіївський роднічок - рускій дух\n\n' \
              'Перехоплення гумконвою - секретний рейдовий режим, який можуть активувати тільки танкісти. Сила - ' \
              '2000000, оновлюється раз в день. Нагорода - по 1 пакунку за кожні 20000 сили команди. ' \
              'За повне розграбування додається 5 пакунків.\n' \
              'Ставок швайнокарасів - ще секретніший рейдовий режим...\n\n' \
              'За будь-який рейд є 5% шанс випадіння \U0001F916 секретного коду.'

    if data.startswith('wiki_clan'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001F530 Клан - об`єднання русаків, яке з кожним рівнем додає більше бонусів.\n' \
              'Всі команди для керування кланом є у /commands.\n' \
              'Творець клану стає лідером. Заступники можуть бути призначеі лідером і мати майже такі самі можливості' \
              ' як лідер.\n\nРівні кланів:\n\n\U0001f6d6 Банда - можливість обирати фашиста дня, добувати та зберігат' \
              'и деревину і каміння.\n' \
              '\U0001F3E0 Клан - \U0001F4B5 +6 гривень та \U0001F47E +1 рускій дух за перемоги в міжчатових боях, ' \
              'якщо серед учасників всі з клану.\n' \
              '\U0001F3E1 Гільдія - \U0001F4B5 +34% за роботу на шахтах Соледару.\n' \
              '\U0001F3D8 Угруповання - \U0001F4B5 шанс подвоїти грошову нагороду за перемогу в дуелях.\n\n' \
              'Далі доведеться вибрати один з чотирьох рівнів, які є відсиланням на політичний компас.'
    if data.startswith('wiki_com'):
        markup.add(InlineKeyboardButton(text='\U0001F530', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e5 Комуна\n' \
              'Ресурси в клані добуваються в максимальному обсязі. Ціна на совєцкій пайок зменшена з 10 до 4 гривень.' \
              '\n\nІнфраструктура:\n' \
              'Тракторний завод - можливість купувати уламки бронетехніки та зміцнювати ними броню до 50.\n' \
              'Пивний ларьок - роботяги добувають вдвічі білье ресурсів.\n' \
              'Падік - здібність гопніка буде дійсна, якщо на рахунку до 200 гривень.\n' \
              'Тюрма - сила мусора при охороні збільшиться на 100%.\n\n' \
              '\U0001f7e5 Союз\n' \
              'Можливість закупити всьому клану дрини і щити за 200 деревини і 100 каміння. Можливість закупити ' \
              'горілку тим, хто відпрацював зміну.' \
              '\n\nІнфраструктура:\n' \
              'Воєнкомат - можливість купити АК-47 та вушанку або безкоштовно отримати за охорону.\n' \
              'Гулаг - за покидання клану сила двох русаків зменшиться на 20%. За роботу чи охорону буде шанс ' \
              'отримати додаткове годування по 1% за кожну тисячу деревини, каменю, тканини і цегли.'
    if data.startswith('wiki_coa'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001F530', callback_data='wiki_clan'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9 Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e6 Коаліція\n' \
              'За купівлю бойового трансу за рускій дух - додатково збільшиться бойовий дух на 50%. +2 руского духу' \
              ' за перемогу у міжчатових битвах.' \
              '\n\nІнфраструктура:\n' \
              'Штаб тероборони - можливість купувати тактичний шолом та міни. Зменшує ефективність ворожих рейдів на ' \
              '33%.\n' \
              'Березова роща - якщо язичник застосує сокиру Перуна проти іншого язичника - обидва отримають ' \
              'по 10000 бойового духу\n' \
              'Генеральська дача - присутність генерала в міжчатовій битві додатково принесе 1 рускій дух за ' \
              'перемогу.\n' \
              'Казарма - +20% сили гарматному м`ясу в міжчатових битвах.\n\n' \
              '\U0001f7e6 Орден\n' \
              'Можливість купляти РПГ-7 та Бронежилет вагнерівця за кланові гроші і рускій рух для лідера та' \
              ' заступників.' \
              '\n\nІнфраструктура:\n' \
              'Ферма - годування русака лікує до 30 поранень. Можливість зберегти кавун ще на 1 годування.\n' \
              'Ядерний бункер - шизофренія не впливатиме негативно на міжчатові битви, рейди та охорону, а навпаки - ' \
              'додаватиме 5 інтелекту. Можливість купляти шапочки з фольги.'
    if data.startswith('wiki_aso'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001F530', callback_data='wiki_clan'),
                   InlineKeyboardButton(text='\U0001f7e8 Організація', callback_data='wiki_org'))
        msg = '\U0001f7e9 Асоціація\n' \
              'Зменшує силу локацій в рейдах на 50%. При отриманні грошової нагороди - ' \
              'ви отримаєте 20% гривень на власний рахунок.' \
              '\n\nІнфраструктура:\n' \
              'Dungeon - можливість купувати батіг (+25% сили в рейдах, або +75%, якщо нема жінки).\n' \
              'Бійцівський клуб - втричі більший шанс кинути прогином хачам.\n' \
              'Циганський табір - 20% шанс фокусникам вкрасти грошову нагороду ворога в дуелях.\n' \
              'Радіовежа - малорос в міжчатовій битві надсилає 3 шизофренії випадковому ворогу.\n\n' \
              '\U0001f7e9 Ліга\n' \
              'Якщо під час рейду виявлено, що ціль має більше ресурсів - рейдери вкрадуть вдвічі більше. ' \
              'Можливість грабувати гумконвой без танкістів. В такому випадку, шанс активувати цей режим - 20%. ' \
              'Можливість купувати БпЛА.' \
              '\n\nІнфраструктура:\n' \
              'Готель - максимальна кількість учасників збільшується до 10. Можливість вступати в клан в будь-який ' \
              'момент (не треба чекати тиждень після вступу в попередній клан, а 3 години).\n' \
              'Офіс Червоного Хреста - можливість лікувати весь клан, та проводити перерозподіл багатств - за 500 ' \
              'гривень з скарбниці по 100 гривень 5 найбіднішим учасникам.'
    if data.startswith('wiki_org'):
        markup.add(InlineKeyboardButton(text='\U0001f7e5 Комуна', callback_data='wiki_com'),
                   InlineKeyboardButton(text='\U0001f7e6 Коаліція', callback_data='wiki_coa'))
        markup.add(InlineKeyboardButton(text='\U0001f7e9Асоціація', callback_data='wiki_aso'),
                   InlineKeyboardButton(text='\U0001F530', callback_data='wiki_clan'))
        msg = '\U0001f7e8 Організація\n' \
              'Скасовуються податки. +6 гривень в кланову скарбницю за перемогу в міжчатовій битві.' \
              '\n\nІнфраструктура:\n' \
              'Біолабораторія - можливість купувати королівські мухомори (тим, в кого русак має до 20 інтелекту).\n' \
              'Аптека - патологоанатом з аптечкою отримуватиме по 10 гривень за воскрешання русаків.\n' \
              'АЗС - можливість купити дизель в клановому магазині для таксистів.\n' \
              'Дата-центр - здібність хакера надсилатиме стільки ж грошей в скарбницю клану.\n\n' \
              '\U0001f7e8 Корпорація\n' \
              'За інвестиції від 1000 гривень інвестор отримає по пакунку за кожні 20 гривень. +1% до сили охорони ' \
              'за кожну тисячу гривень у скарбниці (максимум 200%).' \
              '\n\nІнфраструктура:\n' \
              'Торговий центр - можливість купити Цукор і квас для себе та Кавун базований для всього клану.\n' \
              'Невільничий ринок - можливість купувати російських немовлят. Нові русаки з`являтимуться з 500+ сили.'

    if data.startswith('wiki_grow_feed'):
        markup.add(InlineKeyboardButton(text='\u2692', callback_data='wiki_grow_mine'),
                   InlineKeyboardButton(text='\U0001F349', callback_data='wiki_grow_support'),
                   InlineKeyboardButton(text='\U0001F919', callback_data='wiki_grow_class'))
        msg = '\U0001F4C8 Розвиток\n\nУ русака є дві основні характеристики - \U0001F4AA сила та \U0001F9E0 інтелект.' \
              '\n\n\U0001F372 Годуючи, можна збільшити силу на 1-30 та інтелект на 1 (шанс 20%). В магазині можна ' \
              'купити утеплену будку, яка збільшуватиме силу на 15 до 2000 сили. Якщо в русака від 3000 сили, то вона' \
              ' може зменшитись з шансом 20%, а якщо більше 4000 - 40%. Також є 20% шанс шо русак захворіє і нічо не ' \
              'зміниться.\nЗ шансом 30% годування збільшить \U0001F54A бойовий дух на 1000, а з шансом 5% - до ' \
              'максимуму(10000).\nМаксимальна кількість інтелекту - 20.'
    if data.startswith('wiki_grow_mine'):
        markup.add(InlineKeyboardButton(text='\U0001F372', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\U0001F349', callback_data='wiki_grow_support'),
                   InlineKeyboardButton(text='\U0001F919', callback_data='wiki_grow_class'))
        msg = '\u2692 Соляні шахти - місце, де можна заробити гроші (3-8) або інтелект (шанс 10%), відпрацювавши ' \
              'зміну. Повністю прокачавши майстерність (/skills) можна заробляти на 2 гривні більше, збільшити шанс ' \
              'отримати інтелект до 20% та зразу отримати 2 інтелекту. Якщо інтелект максимальний - може бути ' \
              'додатково видано 20 гривень. В суботу і неділю зарплата вдвічі більша. Також 20% шанс, що русак ' \
              'втече і нап`ється. 25% шанс забрати з собою одну сіль.'
    if data.startswith('wiki_grow_support'):
        markup.add(InlineKeyboardButton(text='\U0001F372', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\u26CF', callback_data='wiki_grow_mine'),
                   InlineKeyboardButton(text='\U0001F919', callback_data='wiki_grow_class'))
        msg = 'Спорядження, яке впливає на розвиток:\n\U0001F344 Мухомор королівський - в дуелі збільшує інтелект на ' \
              '1, якщо русак б`ється проти розумнішого. Можна купити до 3 штук в мандрівного торговця.\n' \
              '\U0001F35E Хліб справжній - збільшує шанс отримати 10000 бойового духу за годування до 100%.\n' \
              '\U0001F9EA Цукор - збільшує силу за годування на 15 (до 3000) або зменшує шанс зменшення сили на ' \
              '15%, додає 5 бойового трансу.\n' \
              '\U0001F349 Кавун базований - збільшує силу за годування і гроші за зміну на 5. Зникає тільки ' \
              'тоді, коли сила за годування зменшиться.\n' \
              '\U0001F37A Квас - русак не втече зі зміни на соляних шахтах. Додає 5 бойового трансу.'
    if data.startswith('wiki_grow_class'):
        markup.add(InlineKeyboardButton(text='\U0001F372', callback_data='wiki_grow_feed'),
                   InlineKeyboardButton(text='\u2692', callback_data='wiki_grow_mine'),
                   InlineKeyboardButton(text='\U0001F349', callback_data='wiki_grow_support'))
        msg = 'Розвинувши інтелект до певного рівня, можна вибрати клас. Вплив класів на розвиток:\n' \
              '\U0001F919\U0001F919\U0001F919 Гроза Кавказу кожен день може збільшувати силу на 10 та один раз - ' \
              'на 200.\n\U0001F9F0 Роботяга не хворіє, але вдвічі більше п`є.\n' \
              '\U0001F9F0\U0001F9F0 - Почесний алкаш швидше качає вміння.\n' \
              '\U0001F9F0\U0001F9F0\U0001F9F0 - П`яний майстер - при певній умові може годуватись два рази.\n' \
              '\U0001F52E Фокусник та Злий геній отримують додатковий інтелект при виборі класу.\n' \
              '\U0001F921 Малорос може анулювати інтелект за мухомори всім в чаті.\n' \
              '\U0001F4DF\U0001F4DF Кіберзлочинець точно може успішно відпрацювати зміну, та купувати необмежену ' \
              'кількість мухоморів в торговця.\n' \
              '\U0001F6AC\U0001F6AC Зек вдвічі збільшує бонус сили від утепленої будки.\n' \
              '\U0001F396 Офіцер може отримати інтелект в міжчатових битвах.'

    if data.startswith('wiki_passport'):
        markup.add(InlineKeyboardButton(text='\U0001F4E6', callback_data='wiki_pack'),
                   InlineKeyboardButton(text='\u2B50', callback_data='wiki_achieve'))
        msg = '\U0001F4DC Паспорт\n\n' \
              '\U0001F3C6 Перемоги можна отримати за... перемоги в дуелях, масових та міжчатових битвах.\n' \
              '\U0001F3C5 Трофеї можна отримати за перемоги в масових та міжчатових битвах.\n' \
              '\u2620\uFE0F Русаків можна вбивати, продавши жінку. Також можна зарізати свого ' \
              'або знайти в пакунку чужого.\n' \
              '\U0001F476 Немовлят можна отримувати провідуючи жінку, за фашиста дня і за досягнення.\n' \
              '\u2622 Найпростіший спосіб отримати горілку - купити в магазині.\n' \
              '\U0001F4E6 Донбаські пакунки можна придбати командою /pack або купити в \n/donate_shop\n' \
              '\u26CF Вміння можна качати в /skills\n' \
              '\u2B50 /achieve - подивитись досягнення (ачівки - фрази з українських пісень).\n\n' \
              '\U0001F947 Формула розрахунку рейтингу:\n' \
              'Рейтинг = сила + інтелект * 10 + перемоги + трофеї * 10 + вбивства * 14 + немовлята * 88\n\n' \
              '\u26CF Промокоди - невелика нагорода, яку можна отримати один раз. Промокод, який зміцнює ' \
              'спорядження:\n' + r.hget('promo_code', 'strength_promo_code').decode()
    if data.startswith('wiki_pack'):
        markup.add(InlineKeyboardButton(text='\U0001F4DC', callback_data='wiki_passport'),
                   InlineKeyboardButton(text='\u2B50', callback_data='wiki_achieve'))
        msg = 'Предмети в пакунках і шанси випадіння:\n\n' \
              '\u26AA Нічого - 20% (або радіотехніка)\n' \
              '\u26AA Спорядження класу - 18%\n' \
              '\u26AA Дрин і щит - 15%\n' \
              '\u26AA 4 гривні - 12%\n' \
              '\u26AA Уламок - 10%\n' \
              '\U0001f535 50 гривень - 7%\n' \
              '\U0001f535 20 горілки - 6%\n' \
              '\U0001f535 Мертвий русак - 5%\n' \
              '\U0001f7e3 Мухомор королівський - 3%\n' \
              '\U0001f7e3 Шапочка з фольги - 2%\n' \
              '\U0001f7e3 300 грн, годування і ачівка - 1%\n' \
              '\U0001f7e1 РПГ-7 - 0.225%\n' \
              '\U0001f7e1 Бронежилет - 0.225%\n' \
              '\U0001f7e1 Швайнокарась - 0.225%\n' \
              '\U0001f7e1 Ярмулка - 0.225%\n' \
              '\U0001f7e1 Погон російського генерала - 0.1%'
    if data.startswith('wiki_achieve'):
        markup.add(InlineKeyboardButton(text='\U0001F4DC', callback_data='wiki_passport'),
                   InlineKeyboardButton(text='\U0001F4E6', callback_data='wiki_pack'))
        msg = 'Досягнення і як їх отримати:\n\n' \
              '\u26AA Хто не з нами, той нехай йде собі до сраки - попрацювати в Соледарі за допомогою секретної ' \
              'команди\n' \
              '\u26AA І москаля нема, немає москаля - влаштувати одне вбивство\n' \
              '\u26AA Моя фамілія Залупа - купити трофейний паспорт\n' \
              '\u26AA Наливай, куме, горілки стаканчик - випити 150 горілки \n' \
              '\u26AA Бігає по полю весело кабанчик - погодувати русака 15 разів\n' \
              '\U0001f535 Геніальний розум, великий чоловік - набрати 20 інтелекту\n' \
              '\U0001f535 Гордо і достойно ти живеш свій вік - набрати 2000 сили\n' \
              '\U0001f535 Зараз розберемося, кому належить вулиця - увійти в масову битву і нажати /achieve\n' \
              '\U0001f535 Ах лента за лентою набої подавай - Купити спорядження свого класу в торговця\n' \
              '\U0001f7e3 Ніколи не плач на радість орді - набрати 10000 бойового духу і виконати команду /achieve\n' \
              '\U0001f7e3 Ворога знищено, як був наказ - набрати 1000 перемог\n' \
              '\U0001f7e3 Я заводжу хімікат, розпочинаю атентат - вибити з пакунків\n' \
              '\U0001f7e3 А до берега тихо хвилі несуть поранені душі живих кораблів - бути в стані бойового трансу ' \
              'з пораненням і шизофренією\n' \
              '\U0001f534 Я мав купу бабок, я мав купу справ - інвестувати в клан мінімум 500 гривень за раз\n' \
              '\U0001f534 Танцюй і пий, поки живий - отримати як мінімум чверть бонусу від моргу в міжчатовій битві\n' \
              '\U0001f534 Кривавий пастор - влаштувати 15 вбивств і з`їсти 15 російських немовлят'

    if not data == 'wiki_menu':
        markup.add(InlineKeyboardButton(text='\u21A9\uFE0F', callback_data='wiki_menu'))
    return msg, markup
